Wall type '[Type Name]' is incompatible with picked face. Only basic wall types are accepted.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FaceWallBadType { get; }
  Visual Basic
Public Shared ReadOnly Property FaceWallBadType As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FaceWallBadType {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace